In [2]:
#For the demo of Pandas Libray, both pandas and numpy library should be imported as below.
import pandas as pd
import numpy as np
import time
import sys

print(f"python: {sys.version}")
print(f"python executable: {sys.executable}")
print(f"time: {time.asctime()}")

python: 3.8.8 (default, Apr 13 2021, 15:08:03) [MSC v.1916 64 bit (AMD64)]
python executable: C:\Users\Admin\anaconda3\python.exe
time: Tue Mar  1 11:48:03 2022

##  This is markdown test##

In [3]:
print(f"time: {time.asctime()}")

time: Mon Feb 28 22:16:51 2022

In [4]:
# Creat starter variables for the demo (from online source)
labels = ['a', 'b', 'c']
my_list = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a':10, 'b':20, 'c':30}

In [5]:
#create a Series
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [7]:
#create a Series with labels
pd.Series(my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [8]:
#create a Series froma  dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [10]:
#create a DataFrame with column names
pd.DataFrame([
    ['John Smith','123 Main St',34],
    ['Jane Doe', '456 Maple Ave',28],
    ['Joe Schmo', '789 Broadway',51]
    ])
columns=['name','address','age'])

            0              1   2
0  John Smith    123 Main St  34
1    Jane Doe  456 Maple Ave  28
2   Joe Schmo   789 Broadway  51

In [13]:
#create starter variables for DataFrame creation
rows = ['X','Y','Z']
cols = ['A', 'B', 'C', 'D', 'E']
data = np.round(np.random.randn(3,5),2)
pd.DataFrame(data, rows, cols)

      A     B     C     D     E
X  0.09  0.97 -1.69  1.38  1.01
Y  0.07 -0.31  1.36 -0.04  1.43
Z -1.38 -0.12  2.33  0.71 -1.52

In [14]:
#create a DataFrame with row names, column names, and data.
df = pd.DataFrame(data, rows, cols)

#select a column using []
df['A']

X    0.09
Y    0.07
Z   -1.38
Name: A, dtype: float64

In [16]:
#select multiple columns using[]
df[['A', 'E']]

      A     E
X  0.09  1.01
Y  0.07  1.43
Z -1.38 -1.52

In [15]:
#select an element
df['A']['X']

0.09

In [18]:
#select a row using .loc attribute
df.loc["X"]

A        0.09
B        0.97
C       -1.69
D        1.38
E        1.01
A + B    1.06
Name: X, dtype: float64

In [19]:
#create df_1 DataFrame to demo Handling missing data
df_1 = pd.DataFrame(np.array([[1, 5, 1],[2, np.nan, 2],[np.nan, np.nan, 3]]))

df_1.columns = ['A', 'B', 'C']

df_1

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  3.0

In [20]:
# Deletes columns or rows that contain missing values (NaN)
df_1.dropna()

     A    B    C
0  1.0  5.0  1.0

In [17]:
#Add column to DataFrame
df['A + B'] = df['A'] + df['B']
df

      A     B     C     D     E  A + B
X  0.09  0.97 -1.69  1.38  1.01   1.06
Y  0.07 -0.31  1.36 -0.04  1.43  -0.24
Z -1.38 -0.12  2.33  0.71 -1.52  -1.50